recipes = [
    {
        "key": "ovsyanka",
        "title": "Овсянка с ягодами и орехами",
        "ingredients": ["50 г овсяных хлопьев", "200 мл молока/воды", "горсть ягод", "10 г орехов"],
        "steps": ["Залить овсянку молоком, варить 5–7 минут", "Добавить ягоды и орехи"],
        "calories": 350,
        "prot": 10, "fat": 12, "carb": 45
    },
    {
        "key": "grechka_kurica",
        "title": "Гречка с курицей и овощами",
        "ingredients": ["100 г гречки", "150 г куриного филе", "овощи"],
        "steps": ["Отварить гречку", "Обжарить курицу", "Смешать с овощами"],
        "calories": 520, "prot": 38, "fat": 12, "carb": 60
    }
]
